title: Suspicious PowerShell Enumeration Using Get-WmiObject  
id: c45b70fd-e244-4e80-b121-020fd4e34b06
status: test  
description: Detects PowerShell execution using a bypassed execution policy where Get-WmiObject is used with Win32_UserAccount, which may indicate account enumeration for reconnaissance.  
author: [your_name_here]
date: 2025-05-13
tags:  
  - attack.discovery  
  - attack.t1087  
logsource:  
  product: windows  
  category: process_creation  
detection:  
  selection:  
    OriginalFileName: "PowerShell.EXE"  
    CommandLine|contains:  
      - "-ExecutionPolicy Bypass"  
      - "Get-WmiObject"  
      - "Win32_UserAccount"  
  condition: all of selection  
falsepositives:  
  - Legitimate administrative or troubleshooting usage  
level: medium  
