title: Detection of 'whoami /user' Command Execution with Obfuscation
id: fb09d549-6983-484a-ae41-6b06aa4e192c
description: Detects the execution of 'whoami /user' command, including common obfuscation techniques, which can be used for user enumeration by attackers.
author: Yusuke Nakajima
date: 2025-03-06
tags:
  - attack.execution
  - attack.discovery
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    EventID: 4688
    CommandLine|re:
      - '(?i)\\bwhoami\\b.*[/-][''"]?u[^a-zA-Z0-9]*s[^a-zA-Z0-9]*e[^a-zA-Z0-9]*r[''"]?'
  condition: selection
falsepositives:
  - Legitimate use of 'whoami /user' command for administrative or troubleshooting purposes.
level: medium
